mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	/* display off */
	OLED_CTRL(0xae);
	OLED_CTRL_WRITE;
	CLRWDT();

	/* set freq */
	OLED_CTRL(0xd5); OLED_CTRL(0xa0);
	OLED_CTRL_WRITE;
	CLRWDT();
	/* set multiplexer */
	OLED_CTRL(0xa8); OLED_CTRL(0x3f);
	OLED_CTRL_WRITE;
	CLRWDT();

	/* display offset */
	OLED_CTRL(0xd3); OLED_CTRL(0x00);
	/* start line */
	OLED_CTRL(0x40);
	/* segment remap */
	OLED_CTRL(0xa0);
	/* com output scan direction */
	OLED_CTRL(0xc0);
	/* com pin hardware config */
	OLED_CTRL(0xda); OLED_CTRL(0x12);
	/* current control */
	// OLED_CTRL(0x81); OLED_CTRL(0xdf);
	OLED_CTRL(0x81); OLED_CTRL(bright);
	/* pre-charge period */
	OLED_CTRL(0xd9); OLED_CTRL(0x82);
	/* vcomh deselect level */
	OLED_CTRL(0xdb); OLED_CTRL(0x34);
	/* entire display on/off */
	OLED_CTRL(0xa4);
	/* normal/inverse */
	OLED_CTRL(0xa6);
	OLED_CTRL_WRITE;
	CLRWDT();
	/* clear RAM */
	OLED_CTRL(0x20); OLED_CTRL(0x00); /* page addressing mode */
	OLED_CTRL(0x21); OLED_CTRL(0x00); OLED_CTRL(0x7f); /*column start/end */
	OLED_CTRL(0x22); OLED_CTRL(0x00); OLED_CTRL(0x07); /*page start/end */
	OLED_CTRL(0x00); OLED_CTRL(0x10);  /* column start */
	OLED_CTRL(0xb0); /* page start */
	OLED_CTRL_WRITE;
	CLRWDT();
#if 0
	i2c_buf[0] = 0x20; i2c_buf[1] = 0x00;
	i2c_buf[2] = 0x21; i2c_buf[3] = 0x00; i2c_buf[4] = 0x7f; /*column start/end */
	i2c_buf[5] = 0x22; i2c_buf[6] = 0x00; i2c_buf[7] = 0x07; /*page start/end */
	i2c_buf[8] = 0x00; i2c_buf[9] = 0x10;  /* column start */
	i2c_buf[10] = 0xb0; /* page start */
	i2c_writecontrol_m(OLED_ADDR, 11);
#endif

	CLRWDT();
	memset(i2c_buf, 0, I2C_BUFSZ);
	printf(" buf size %d", (int)I2C_BUFSZ);
	i2c_buf[0] = 0x1;

	for (l = 0; l < OLED_DISPLAY_SIZE; l += I2C_BUFSZ) {
		OLED_DATA(I2C_BUFSZ);
		i2c_buf[0] = 0x0;
		CLRWDT();
	}
	/* set display on */
	OLED_CTRL_RESET
	OLED_CTRL(0xaf);
	OLED_CTRL_WRITE;
	CLRWDT();
	printf(" done\n");

	NDOWN = 1;
	/* wait 50ms for pac1953 to be up */
	for (c = 0; c < 50; c++) {
		t0 = timer0_read();
		while (timer0_read() - t0 < TIMER0_1MS) {
			; /* wait */
		}
	}

#ifdef USELOG
#if 0
	log_erase();
#endif

	/* look for current block */
	printf("blocks");
	for (c = 0; c < LOG_BLOCKS; c++) {
		printf(" 0x%x", battlog[c].b_flags);
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_PART) {
			/* found it */
			log_cblk = c;
			log_gen = battlog[c].b_flags & B_FILL_GEN;
			break;
		}
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_FULL) {
			uint8_t c2 = (c + 1) & LOG_BLOCKS_MASK;
			if ((battlog[c2].b_flags & B_FILL_STAT)
			    == B_FILL_FREE) {
				/* stopped just at boundary */
				log_cblk = c2;
				log_gen = battlog[c].b_flags & B_FILL_GEN;
				if (log_cblk == 0)
					log_gen += 0x4;
				break;
			}
		}
	}
	printf("\n");
	if (c == LOG_BLOCKS) {
		/* log empty, start a 0 */
		printf("log empty\n");
		log_cblk = 0;
		log_gen = 0;
	}
	/* look for first free entry in block */
	for (c = 0; c < LOG_ENTRIES; c++) {
		if (battlog[log_cblk].b_entry[c].s.nvalid == 1) {
			/* first free entry */
			log_centry = c;
			break;
		}
	}
	if (c == LOG_ENTRIES) {
		/* log corrupted, reset */
		printf("non-full block with no free entry: reset log\n");
		log_erase();
	}
	page_read(&battlog[log_cblk]);

	memset(&curlog.b_entry[log_centry], 0, sizeof(union log_entry));

	next_log_entry();
#endif /* USELOG */

again:
	c = 0;
	i2c_readreg(PAC_I2C_ADDR, PAC_PRODUCT, &i2cr, 1, &pac_i2c_return);
	if (i2c_wait(&pac_i2c_return) != 0)
		c++;
	else 
		printf("product id 0x%x ", i2cr);

	i2c_readreg(PAC_I2C_ADDR, PAC_MANUF, &i2cr, 1, &pac_i2c_return);
	if (i2c_wait(&pac_i2c_return) != 0)
		c++;
	else
		printf("manuf id 0x%x ", i2cr);

	i2c_readreg(PAC_I2C_ADDR, PAC_REV, &i2cr, 1, &pac_i2c_return);
	if (i2c_wait(&pac_i2c_return) != 0)
		c++;
	else
		printf("rev id 0x%x\n", i2cr);

	i2c_readreg(PAC_I2C_ADDR, PAC_CTRL_ACT,
	    (uint8_t *)&pac_ctrl, sizeof(pac_ctrl), &pac_i2c_return);
	if (i2c_wait(&pac_i2c_return) != 0)
		c++;
	else {
		printf("CTRL_ACT al1 %d al2 %d mode %d dis %d\n",
		    pac_ctrl.ctrl_alert1,
		    pac_ctrl.ctrl_alert2,
		    pac_ctrl.ctrl_mode,
		    pac_ctrl.ctrl_chan_dis);
	}

#ifdef USEPAC
	pac_ctrl.ctrl_alert1 = pac_ctrl.ctrl_alert2 = CTRL_ALERT_ALERT;
	pac_ctrl.ctrl_mode = CTRL_MODE_1024;

	if (i2c_writereg(PAC_I2C_ADDR,
	    PAC_CTRL, (uint8_t *)&pac_ctrl, sizeof(pac_ctrl)) == 0) {
		printf("wr PAC_CTRL fail\n");
		c++;
	}

	pac_accumcfg.accumcfg_acc1 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc2 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc3 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc4 = ACCUMCFG_VSENSE;
	if (i2c_writereg(PAC_I2C_ADDR,
	    PAC_ACCUMCFG, (uint8_t *)&pac_accumcfg, sizeof(pac_accumcfg)) == 0) {
		printf("wr PAC_ACCUMCFG fail\n");
		c++;
	}

	pac_neg_pwr_fsr.pwrfsr_vb1 = pac_neg_pwr_fsr.pwrfsr_vs1 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vb2 = pac_neg_pwr_fsr.pwrfsr_vs2 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vb3 = pac_neg_pwr_fsr.pwrfsr_vs3 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vb4 = pac_neg_pwr_fsr.pwrfsr_vs4 = PAC_PWRSFR_BHALF;
	if (i2c_writereg(PAC_I2C_ADDR,
	    PAC_NEG_PWR_FSR, (uint8_t *)&pac_neg_pwr_fsr,
	    sizeof(pac_neg_pwr_fsr)) == 0) {
		printf("wr PAC_NEG_PWR_FSR fail\n");
		c++;
	}

	if (i2c_writecmd(PAC_I2C_ADDR, PAC_REFRESH) == 0) {
		printf("cmd PAC_REFRESH fail\n");
		c++;
	}
	if (c != 0)
		goto again;
#endif /* USEPAC */

	oled_col = 40;
	oled_line = 4;
	sprintf(oled_displaybuf, "hello");
	displaybuf_small();

	btn_state = BTN_IDLE;

	FVRCON = 0x8c; /* FVR on, CDAFVR 4.096v */

	CM1CON0 = 0x42; /* invert polarity, hysteresis */
	CM1CON1 = 0x03; /* interrupt on both edges */
	CM1NCH = 0x01; /* CH1IN1- */
	CM1PCH = 0x06; /* FVR */
	CM1CON0bits.EN = 1;
	PIR1bits.C1IF = 0; /* clear any pending interrupt */
	PIE1bits.C1IE = 1; /* enable */

	while (1) {
		CLRWDT();
		if (C1INTLbits.RXIF) {
			nmea2000_receive();
		}
		if (NCANOK) {
			nmea2000_status = NMEA2000_S_ABORT;
			poll_count = timer0_read();;
		} else if (nmea2000_status != NMEA2000_S_OK) {
			uint16_t ticks, tmrv;

			tmrv = timer0_read();
			ticks = tmrv - poll_count;
			if (ticks > TIMER0_5MS) {
				poll_count = tmrv;
				nmea2000_poll(ticks / TIMER0_1MS);
			}
			if (nmea2000_status == NMEA2000_S_OK) {
				printf("new addr %d\n", nmea2000_addr);
			}
		}

#ifdef USEADC
		if (PIR1bits.ADIF) {
			PIR1bits.ADIF = 0;
			a2d_acc = ((unsigned int)ADRESH << 8) | ADRESL;
			switch (ADPCH) {
			case 0:
				/* channel 0: NTC */
				adctotemp(0);
				ADCON0bits.ADON = 0;
				ADPCH = 1;
				ADCON0bits.ADON = 1;
				break;
			case 1:
				/* channel 1: NTC */
				adctotemp(1);
				ADCON0bits.ADON = 0;
				ADPCH = 4;
				ADCON0bits.ADON = 1;
				break;
			case 4:
				/* channel 4: NTC */
				adctotemp(2);
				ADCON0bits.ADON = 0;
				ADPCH = 0;
				/* don't set ADON, will do on next second */
				break;
			default:
				printf("unknown channel 0x%x\n", ADCON0);
			}
		}
#endif

		if (softintrs.bits.int_btn_down) {
			softintrs.bits.int_btn_down = 0;
			btn_state = BTN_DOWN;
			/* get btn value */
			/* XXX context */
			ADCTX = 3;
			PIR1bits.ADIF = 0;
			PIE1bits.ADIE = 1;
			ADCON0bits.ADON = 1;

