mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
		}
		if (softintrs.bits.int_btn_up) {
			softintrs.bits.int_btn_up = 0;
			switch(btn_state) {
			case BTN_DOWN_1:
			case BTN_DOWN_1_P:
			case BTN_DOWN_2:
			case BTN_DOWN_2_P:
				/* this is a up event */
				btn_state = BTN_UP;
				break;
			default:
				/* transient event */
				btn_state = BTN_IDLE;
				break;
			}
		}
		if (softintrs.bits.int_adcc) {
			if (btn_state == BTN_DOWN) {
				if (ADRES > 0x600 && ADRES < 0x900) {
					btn_state = BTN_DOWN_2;
				} else if (ADRES > 0x400 && ADRES < 0x600) {
					btn_state = BTN_DOWN_1;
				} else {
					/* transient event */
					btn_state = BTN_IDLE;
				}
			} else {
				btn_state = BTN_IDLE;
			}
			// printf("ADC complete 0x%x\n", ADRES);
			softintrs.bits.int_adcc = 0;
			PIR1bits.ADIF = 0;
			PIE1bits.ADIE = 0;
		}

		switch (btn_state) {
		case BTN_DOWN_1:
			oled_col = 40;
			oled_line = 4;
			sprintf(oled_displaybuf, "  B1 ");
			displaybuf_small();
			printf("B1\n");
			btn_state = BTN_DOWN_1_P;
			break;
		case BTN_DOWN_2:
			oled_col = 40;
			oled_line = 4;
			sprintf(oled_displaybuf, "  B2 ");
			displaybuf_small();
			printf("B2\n");
			btn_state = BTN_DOWN_2_P;
			break;
		case BTN_UP:
			oled_col = 40;
			oled_line = 4;
			sprintf(oled_displaybuf, "  up ");
			displaybuf_small();
			printf("up\n");
			btn_state = BTN_IDLE;
			break;
		}

		if (softintrs.bits.int_10hz) {
			softintrs.bits.int_10hz = 0;
#ifdef USEPAC
			/* read voltage values */
			for (c = 0; c < 4; c++) {
				pac_vbus_t pac_vbus;
				if ((pac_ctrl.ctrl_chan_dis & (8 >> c)) != 0)
					continue;
				if (i2c_readreg_be(PAC_I2C_ADDR,
				    PAC_VBUS1_AVG + c,
				    &pac_vbus, sizeof(pac_vbus)) ==
				    sizeof(pac_vbus))
					voltages_acc_cur[c] += pac_vbus.vbus_s;
				else
					printf("read v[%d] fail\n", c);
			}
#endif /* USEPAC */
			counter_1hz--;
#ifdef USEPAC
			switch(counter_1hz) {
			case 6:
				/*
				 * get new values in registers and reset
				  * accumulator. Also freeze software voltage
				  * accumulator.
				  */
				if (i2c_writecmd(PAC_I2C_ADDR,
				    PAC_REFRESH) == 0)
					printf("PAC_REFRESH fail\n");
				for (c = 0; c < 4; c++) {
					voltages_acc[c] = voltages_acc_cur[c];
					l600_voltages_acc[c] +=
					    voltages_acc_cur[c];
					voltages_acc_cur[c] = 0;
				}
				SIDINC(sid);
				break;
			case 5:
				read_pac_channel();
				/* FALLTHROUGH */
			case 4:
			case 3:
			case 2:
				send_batt_status(counter_1hz - 2);
				/* FALLTHROUGH */
			default:
				/* get new values for next voltage read */
				if (i2c_writecmd(PAC_I2C_ADDR,
				    PAC_REFRESH_V) == 0)
					printf("PAC_REFRESH_V fail\n");
			}
#endif /* USEPAC */

			if (counter_1hz == 0) {
				counter_1hz = 10;
				seconds++;
				if (seconds == 600) {
					// USELOG update_log();
					seconds = 0;
				}
				// USEADC  ADCON0bits.ADON = 1; /* start a new cycle */
			} else {
			}
			if (ADCON0bits.ADON)
				ADCON0bits.GO = 1;
			if (!NCANOK && nmea2000_status == NMEA2000_S_OK) {
				uint16_t ticks, tmrv;

				tmrv = timer0_read();
				ticks = tmrv - poll_count;
				if (ticks > TIMER0_5MS) {
					poll_count = tmrv;
					nmea2000_poll(ticks / TIMER0_1MS);
				}
				if (nmea2000_status != NMEA2000_S_OK) {
					printf("lost CAN bus %d\n",
					    ticks);
				}
			}
		}
		if (PIR4bits.U1RXIF && (U1RXB == 'r'))
			break;
		if (softintrs.byte == 0)
			SLEEP();
	}
	while ((c = getchar()) != 'r') {
		printf("resumed %u\n", timer0_read());
		goto again;
	}
	WDTCON0bits.SEN = 0;
	printf("returning\n");
	while (!PIR4bits.U1TXIF) {
		; /* wait */ 
	}
	RESET();
	return 0;
}

unsigned int
timer0_read(void)
{
	unsigned int value;

	/* timer0_value = TMR0L | (TMR0H << 8), reading TMR0L first */
	di();
	asm("movff TMR0L, timer0_read@value");
	asm("movff TMR0H, timer0_read@value+1");
	ei();
	return value;
}

#ifdef USE_TIMER2
void __interrupt(__irq(TMR2), __high_priority, base(IVECT_BASE))
irqh_timer2(void)
{
	PIR3bits.TMR2IF = 0;
	if (--counter_10hz == 0) {
		counter_10hz = 25;
		softintrs.bits.int_10hz = 1;
	}			
}
#else
void __interrupt(__irq(TU16A), __high_priority, base(IVECT_BASE))
irqh_tu16a(void)
{
	TU16ACON1bits.CLR = 1;
	TU16ACON1bits.PRIF = 0;
	softintrs.bits.int_10hz = 1;
}
#endif

void __interrupt(__irq(CM1), __low_priority, base(IVECT_BASE))
irqh_cm1(void)
{
	if (CM1CON0bits.OUT)
		softintrs.bits.int_btn_down = 1;
	else 
		softintrs.bits.int_btn_up = 1;
	PIR1bits.C1IF = 0;
}

void __interrupt(__irq(AD), __low_priority, base(IVECT_BASE))
irqh_adcc(void)
{
	PIE1bits.ADIE = 0;
	softintrs.bits.int_adcc = 1;
}
